opendj-sdk/opends/tests/staf-tests/functional-tests/shared/data/dsml/suites/04addmodaddsuite/data/add110.dat

POST /dsml HTTP/1.1
Host: Foo
Connection: Close
Content-Length: 6158
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
        <addRequest dn="uid=foo25, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo25@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 333 3333</value>
        </attr>
        <attr name="cn">
        <value>foo 25</value>
        </attr>
        <attr name="uid">
        <value>foo25</value>
        </attr>
        <attr name="roomnumber">
        <value>3389</value>
        </attr>
        <attr name="sn">
        <value>25</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 333 3333</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo26, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo26@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 444 4444</value>
        </attr>
        <attr name="cn">
        <value>foo 26</value>
        </attr>
        <attr name="uid">
        <value>foo26</value>
        </attr>
        <attr name="roomnumber">
        <value>329m</value>
        </attr>
        <attr name="sn">
        <value>26</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 444 4444</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo27, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo27@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 555 5555</value>
        </attr>
        <attr name="cn">
        <value>foo 27</value>
        </attr>
        <attr name="uid">
        <value>foo27</value>
        </attr>
        <attr name="roomnumber">
        <value>202k</value>
        </attr>
        <attr name="sn">
        <value>27</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 555 5555</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo28, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo28@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 666 6666</value>
        </attr>
        <attr name="cn">
        <value>foo 28</value>
        </attr>
        <attr name="uid">
        <value>foo28</value>
        </attr>
        <attr name="roomnumber">
        <value>dskjn</value>
        </attr>
        <attr name="sn">
        <value>28</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 666 6666</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
        <addRequest dn="uid=foo29, ou=People, o=dsmlfe.com">
        <attr name="description">
        <value>This is a sample description.</value>
        </attr>
        <attr name="mail">
        <value>foo29@airius.com</value>
        </attr>
        <attr name="objectclass">
        <value>top</value>
        <value>person</value>
        <value>organizationalPerson</value>
        <value>inetOrgPerson</value>
        </attr>
        <attr name="givenname">
        <value>foo</value>
        </attr>
        <attr name="telephonenumber">
        <value>+1 408 777 7777</value>
        </attr>
        <attr name="cn">
        <value>foo 29</value>
        </attr>
        <attr name="uid">
        <value>foo29</value>
        </attr>
        <attr name="roomnumber">
        <value>kskksn</value>
        </attr>
        <attr name="sn">
        <value>29</value>
        </attr>
        <attr name="ou">
        <value>People</value>
        </attr>
        <attr name="facsimiletelephonenumber">
        <value>+1 408 777 7777</value>
        </attr>
        <attr name="l">
        <value>foobar</value>
        </attr>
        </addRequest>
      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
